<!-- dflook/terraform-github-actions {"workspace":"kub1k","backend_type":"local","backend":"f9777addfbfa729ad6679770e1e3f6b062272deb6f95f59d160b884105cd1274","plan_job_ref":"Job Terraform Plan #98 at https://github.com/ironashram/kub1k/actions/runs/11985128967","plan_out_hash":"8da37482401ab2ead04e468416a18006d45051fb78f014b08b3bc71958ead5b0","plan_hash":"f45d227b920e2e8d9afc0a6109a5a15d8550052fd19b7e264e5d27cbe4b86b75","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __terraform__ in the __kub1k__ workspace
<details>
<summary>Plan: 1 to add, 2 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.provision_apps[0].helm_release.argocd will be updated in-place
!~  resource "helm_release" "argocd" {
        id                         = "argocd"
        name                       = "argocd"
!~      version                    = "7.7.3" -> "7.7.5"
#        (27 unchanged attributes hidden)

#        (5 unchanged blocks hidden)
    }

  # module.provision_k3s.data.local_sensitive_file.kubeconfig will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "local_sensitive_file" "kubeconfig" {
+       content              = (sensitive value)
+       content_base64       = (sensitive value)
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       filename             = "/github/home/.kube/config-files/kub1k.yaml"
+       id                   = (known after apply)
    }

  # module.provision_k3s.null_resource.k3s_kubeconfig must be replaced
-/+ resource "null_resource" "k3s_kubeconfig" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "timestamp" = "2024-11-16T17:47:12Z" -> (known after apply)
        }
    }

  # module.provision_k3s.vault_kv_secret_v2.k3s will be updated in-place
!~  resource "vault_kv_secret_v2" "k3s" {
!~      data_json           = (sensitive value)
        id                  = "kv/data/kub1k/k3s"
        name                = "kub1k/k3s"
#        (6 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #98](https://github.com/ironashram/kub1k/actions/runs/11985128967)